// Домашнее задание № 5.3
// Создайте объект на основе ваших данных.

const user = {
  name: "Ислам",
  surname: "Исламов",
  email: "islam@icloud.com",
  work: "Мечеть Аль-Фатах",
  job: "Имам",
  age: 44,
  country: "Казахстан",
  city: "Астана",
  status: "В браке"
}

console.log(user);

// Домашнее задание № 5.4
// Создайте объект, который будет хранить данные об автомобиле
// Добавьте дополнительное свойство - владелец авто, значением которого будет ОБЪЕКТ, описанный в пункте №3.
// Желательно добавлять отдельной строкой (имеется ввиду не при создании объекта)

let car = {
  brand: "Ваз",
  model: 2107,
  year: 2011,
  color: "Чёрный",
  gearbox:"Механическая"
}

car.owner = user;

console.log(car);

// Домашнее задание № 5.5
// Написать функцию которая аргументом будет принимать объект, описанный в пункте №4.
// Она проверяет, есть ли в объекте свойство "максимальная скорость",
// если нет - добавляет его и задает значение, если есть - прекращает выполнение (ничего не делает)

function addMaxSpeed(carObj) { 
  if (!carObj.hasOwnProperty('maxSpeed')) {
      carObj.maxSpeed = 150;
  } else {
      console.log(carObj.maxSpeed);
  }
  return carObj;
}

addMaxSpeed(car);
console.log(car);

// Домашнее задание № 5.6
// Написать функцию, которая получает первым аргументом  — объект,
// а вторым аргументом — свойство объекта, которое нужно вывести и выводит его значение.

const person = {
  name: "Ислам",
  age: 44
}

function getPropertyValue(obj, key) {
    console.log(obj[key]);
}

getPropertyValue(person, "name");

// Домашнее задание № 5.7
// Создать массив, который содержит названия продуктов (просто строки)

const fruits = [ "яблоко", "груша", "апельсин", "лимон", "киви" ];

console.log(fruits);

// Домашнее задание № 5.8
// Создать массив, состоящий из объектов, где объект представляет собой книгу (название, автор, год выпуска, цвет обложки, жанр)
// После, используя известный нам метод массив, добавить еще одну книгу в конец списка.
// Можете заменить книги на фильмы, или другую сущность, идею вы поняли.

const carsVaz = [
  {
    brand: "Ваз",
    model: 2101,
    year: 1987,
    color: "Синий",
    gearbox:"Механическая"
  },

  {
    brand: "Ваз",
    model: 2105,
    year: 1992,
    color: "Красный",
    gearbox:"Механическая"
  },

  {
    brand: "Ваз",
    model: 2106,
    year: 1996,
    color: "Белый",
    gearbox:"Механическая"
  }
]

carsVaz.push(
  {
    brand: "Ваз",
    model: 2107,
    year: 2011,
    color: "Чёрный",
    gearbox:"Механическая"
  }
);

console.log(carsVaz);

// Домашнее задание № 5.9
// Создать еще один массив, состоящих из тех же книг, но относящийся к определенной вселенной (Гарри Поттер, Марвел и так далее).
// (Если используете другую, свою сущность - импровизируйте).
// С помощью известного нам метода массива или оператора (рекомендую использовать оператор), объединить эти два массива в один.

const carsLada = [
  {
    brand: "Лада",
    model: "Приора",
    year: 2010,
    color: "Серебристый",
    gearbox:"Механическая"
  },

  {
    brand: "Лада",
    model: "Гранта",
    year: 2015,
    color: "Бордовый",
    gearbox:"Механическая"
  },

  {
    brand: "Лада",
    model: "Веста",
    year: 2020,
    color: "Серый",
    gearbox:"Автомат"
  },
];

console.log(carsLada);

const allCars = [ ...carsVaz, ...carsLada ];

console.log(allCars);

// Домашнее задание № 5.10
// Почитать про метод массива — map. Написать функцию, которая принимает массив сущностей с задания №9.
// Добавляем новое свойство для объекта "isRare (это редкий)" и в зависимости от года выпуска книги
// (или какой-то логики, связанной с вашей сущностью), устанавливаем true или false.
// Что я хочу этим сказать: если книга выпущена позже 2000 года, устанавливаем true (да, это редкий), нет - false (значит это не редкий).

function getRareCars(carsArray) {
  return carsArray.map(car => {
    return {
      ...car,
      isRare: car.year < 2000
    };
  });
}

const carsWithStatus = getRareCars(allCars);

console.log(carsWithStatus);