// Домашнее задание № 5.3
// Создать функцию, которая принимает 2 параметра: город и температуру и выводит сообщение в консоль
// "Сейчас в X температура  — Y градусов по Цельсию"

const showWeather = (city, temperature) => {
  console.log(`Сейчас в ${city} температура — ${temperature} градусов по Цельсию`);
}

showWeather('Алматы', -10);

// Домашнее задание № 5.4
// Создать переменную, которая хранит внутри себя скорость света (гуглим).
// Создать функцию, которая принимает 1 аргумент - скорость, внутри функции происходит проверка:
// если переданная скорость выше скорости света — выводим лог "Сверхсветовая скорость",
// если ниже — "Субсветовая  скорость"? если равна — "Скорость света"

const SPEED_LIGHT = "299792458 м/с";

function compareSpeed(speed){
    if (speed > SPEED_LIGHT) {
        console.log('Сверхсветовая скорость');
    } else if (speed < SPEED_LIGHT) {
        console.log('Субсветовая скорость');
    } else {
        console.log('Скорость света');
    }
}

compareSpeed("399792458 м/с");
compareSpeed("199792458 м/с");
compareSpeed("299792458 м/с");

// Домашнее задание № 5.5
// Создать переменную №1, которая содержит продукт и переменную №2, которая содержит его цену (на ваше усмотрение).
// Далее создаем функцию, которая принимает 1 параметр - текущий бюджет, внутри функции происходит проверка:
// если бюджет превышает цену товара - выводим лог "(ваше название товара) приобретён. Спасибо за покупку!",
// если нет - обсчитываем разницу и выводим лог "Вам не хватает X$, пополните баланс".
// То-есть с помощью функции мы пытаемся приобрести товар.

function checkPurchase(budget) {
  const arms = "Ак 47";
  const price = 1000;

  const message = budget >= price 
    ? `${arms} приобретён. Спасибо за покупку!` 
    : `Вам не хватает ${price - budget}$, пополните баланс`;

  console.log(message);
}

checkPurchase(2000);
checkPurchase(500);

// Домашнее задание № 5.6
// Создать 1 функцию и именовать её по своему усмотрению

function sayBro(name) {
  console.log(`Ассалямуалейкум, ${name}! Пускай Аллах будет доволен тобой! Аминь!`);
}

sayBro('ахи');

// Домашнее задание № 5.7
// Создать 3 переменных (без разницы каких) и именовать их по своему усмотрению

const myAge = 33;
const myProfession = 'фронтенд-разработчик';
const firstCity = 'Мекку';
const secondCity = 'Медину';

console.log(`Я Абдул Азиз, мне ${myAge} года!`);
console.log(`Моя будущая профессия ${myProfession}!`);
console.log(`Я совершу хиджру в ${firstCity} или в ${secondCity} ин щаа Аллах!`);